---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DuctFailures.CannotCreateGeometryForDuct
source: html/280af687-b26b-2931-5501-24ab9d0cad69.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures.CannotCreateGeometryForDuct Property

Cannot create geometry for flex duct. The flex duct is intersecting itself or the start and end are too close together.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGeometryForDuct { get; }
```